In [12]:
# starting pandas....

import pandas as pd
# # 2d list
# li1=[13,23,3]
# li2=['John','fkdf','jenny']
# dict={'name':li2,'age':li1}
# dict

# how to create a series in pandas
# by list
s1=pd.Series([23,44,32])
s1


#by range
s1=pd.Series(range(11,21))
s1

# by dict
s1=pd.Series({"name":"sam",'age':21})
s1

# by scalar
s1=pd.Series("Hello world")
s1

# # what we can do with pandas
# # read and write data
# # manipualate the data
# # we can accesss sub sets within a large datasets
# # we can perfrom operation
# # we can do reshaping

0    Hello world
dtype: object

In [26]:
import pandas as pd

# dataframe through dict of list
df=pd.DataFrame({'name':['sam','max','tim'],'age':[23,55,33]})
df

# through dict of dict
df=pd.DataFrame({'r1':{"name":"sam","age":32,'city':'hyd'},'r2':{"name":"max","age":55}})
df

# outer keys-colums
# inner keys -index or labels


# how to access the value from the dataframe

# loc
print(df)

# loc[row index,col index]
df.loc['name',"r1"]

# # iloc
df.iloc[1,1]

       r1   r2
name  sam  max
age    32   55
city  hyd  NaN

55

In [14]:
import pandas as pd

std=pd.DataFrame({
    "Name": ["Ram", "Sita", "John", "Ali", "Maria", "Karan", "Priya", "David", "Anita", "Ravi"],
    "Age": [18, 19, 20, 21, 22, 20, 19, 23, 21, 22],
    "Math": [85, 90, 78, 88, 95, 70, 82, 76, 89, 91],
    "Science": [92, 88, 84, 76, 89, 95, 80, 85, 90, 87]
},index=range(11,21))
print(std)
std.loc[14,'Name']
std.iloc[3,0]
std.head()
std.tail()
std.head(2)

     Name  Age  Math  Science
11    Ram   18    85       92
12   Sita   19    90       88
13   John   20    78       84
14    Ali   21    88       76
15  Maria   22    95       89
16  Karan   20    70       95
17  Priya   19    82       80
18  David   23    76       85
19  Anita   21    89       90
20   Ravi   22    91       87

    Name  Age  Math  Science
11   Ram   18    85       92
12  Sita   19    90       88

In [33]:
import pandas as pd
emp={
    101: {"Name": "Alex", "Dept": "HR", "Salary": 45000},
    102: {"Name": "Sam", "Dept": "IT", "Salary": 60000},
    103: {"Name": "John", "Dept": "Finance", "Salary": 55000},
    104: {"Name": "Nina", "Dept": "IT", "Salary": 62000},
    105: {"Name": "Ravi", "Dept": "HR", "Salary": 47000},
    106: {"Name": "Sara", "Dept": "Finance", "Salary": 58000},
    107: {"Name": "David", "Dept": "Marketing", "Salary": 52000},
    108: {"Name": "Ali", "Dept": "IT", "Salary": 61000},
    109: {"Name": "Kiran", "Dept": "Finance", "Salary": 53000},
    110: {"Name": "Maria", "Dept": "HR", "Salary": 49000}
}

df=pd.DataFrame(emp).T
df

# we can add new column 
df['city']='hyd'

# we can change existing coluumn values
df['Salary']+=450

# #how to drop a column
# df.drop(['Name',"Dept"],axis=1,inplace=True)


# how to add a new row
data={"Name":"Sam","Dept":"HR","Salary":23000}

newdata=pd.DataFrame([data])
newupd=pd.concat([df,newdata],ignore_index=True)
newupd

# how to modify the existing value

newupd.iloc[1,0]='sunny'
newupd

# how to drop a perticular row
newupd.drop(1,inplace=True)
newupd

     Name       Dept Salary city
0    Alex         HR  45450  hyd
2    John    Finance  55450  hyd
3    Nina         IT  62450  hyd
4    Ravi         HR  47450  hyd
5    Sara    Finance  58450  hyd
6   David  Marketing  52450  hyd
7     Ali         IT  61450  hyd
8   Kiran    Finance  53450  hyd
9   Maria         HR  49450  hyd
10    Sam         HR  23000  NaN

In [35]:
# Check git version
!git --version

git version 2.51.0.windows.1

In [36]:
!git init

Initialized empty Git repository in C:/Users/SAAD NAIKWADE/saad python pgm/.git/

In [41]:
!git remote add origin https://github.com/Saadnaikwade1/python-programming.git

error: remote origin already exists.

In [47]:
!dir

 Volume in drive C is OS
 Volume Serial Number is 620F-E756

 Directory of C:\Users\SAAD NAIKWADE\saad python pgm

25-09-2025  20:07    <DIR>          .
16-09-2025  00:34    <DIR>          ..
25-09-2025  14:39    <DIR>          .ipynb_checkpoints
11-09-2025  20:09            17,330 basic.ipynb
25-09-2025  20:07            13,220 pandas.ipynb
23-09-2025  12:43            20,404 Python programming.ipynb
               3 File(s)         50,954 bytes
               3 Dir(s)  118,050,295,808 bytes free